
# üß© Titanic Dataset Exploration with pandas

üéØ **Goal:**  
In this notebook, you'll explore the Titanic dataset using **pandas**.  
You'll practice the most common pandas functions for data inspection, selection, filtering, cleaning, and analysis.

For each function in the list below:
1. Explain what it does (in your own words, in a Markdown cell).
2. Give at least **two examples** using the Titanic dataset.
3. Add a short comment about the output or why it‚Äôs useful.

In [53]:

import pandas as pd

# Load Titanic dataset
# (Make sure titanic.csv is in the same folder as this notebook)
df = pd.read_csv("titanic_dataset.csv")

# Show first few rows
df.head()


df2 = pd.DataFrame({'dni':['3434334F','6556656Y','34244299U','43234555B','99999K'],'nombre':['Ana','Leonardo','Sara','Jose','Sara'],'edad':[23,34,43,76,None],
                   'salario':[2100,3000,2000,3000,4355]})


## üß† Step 1: Inspecting the Data

Functions to explore:
- df.head()
- df.tail()
- df.info()
- df.describe()
- df.shape
- df.columns

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n m√©todo head
El m√©todo head nos imprime los primeros datos del archivo csv.

In [54]:
# Example: df.head()
df.head()

# Example 2
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

El m√©todo  devuelve las primeras filas del csv, en la segunda llamada imprime las 10 primeras, este m√©todo sirve para una vez tengamos el archivo csv podamos ver su contenido y hacernos una idea de su contenido.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n m√©todo tail
El m√©todo tail nos imprime los √∫ltimos datos del archivo csv.

In [55]:
# Ejemplo:
df.tail()

# Ejemplo 2:
df.tail(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

El m√©todo  devuelve las √∫ltimas filas del csv, en la segunda llamada imprime las 7 √∫ltimas, este m√©todo sirve para una vez tengamos el archivo csv podamos ver su contenido y hacernos una idea de su contenido.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n m√©todo info
El m√©todo info nos imprime informaci√≥n general del archivo csv, como las columnas, la cantidad de datos, el tipo de datos de cada uno etc.

In [56]:
# Ejemplo:
df.info()

# Ejemplo 2:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

El m√©todo devuelve informaci√≥n general sobre los datos del archivo csv los cuales nos sirven para saber como tratar los datos de este.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n m√©todo describe
El m√©todo describe nos permite tener un res√∫men de las estad√≠sticas del csv

In [57]:
# Ejemplo:
df.describe()

# Ejemplo 2:
df2.describe()

            edad      salario
count   4.000000     5.000000
mean   44.000000  2891.000000
std    22.847319   946.918687
min    23.000000  2000.000000
25%    31.250000  2100.000000
50%    38.500000  3000.000000
75%    51.250000  3000.000000
max    76.000000  4355.000000

El m√©todo devuelve informacion de por ejemplo el m√°ximo de cada columna, minimo etc lo cual nos puede ayudar en caso de querer buscar estad√≠sticas.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n m√©todo shape
El m√©todo shape nos dice cuantas filas y columnas tiene el csv.

In [104]:
# Ejemplo:
df.shape

# Ejemplo 2:
df2.shape

(1, 3)

Nos vale para saber cu√°ntos  datos (filas columnas) tiene el csv de manera r√°pida.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n m√©todo columns
El m√©todo columns nos devuelve las columnas que tiene el csv en forma de lista.

In [105]:
# Ejemplo:
df.columns

# Ejemplo 2:
df2.columns

Index(['PassengerId', 'Comida', 'Estado'], dtype='object')

El m√©todo columns nos vale para ver el nombre y el orden de las columnas de nuestro csv.

# -------------------------------------------------------------------------------------------------------


## üîç Step 2: Selecting Data

Functions to explore:
- df["column"]
- df[["col1", "col2"]]
- df.loc[]
- df.iloc[]

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df["column"]
Nos permite imprimir los datos de la columna que pongamos entre los par√©ntesis

In [ ]:
# Ejemplo1: 
df["Age"].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [61]:
# Ejemplo2:
df["Name"].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

Imprime solamente los datos de la columna Edad y head() hace que solo ponga los 5 primeros.

Lo mismo para la columna Nombre.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n de df[["col1", "col2"]]

Nos permite imprimir las columnas que pongamos entre los par√©ntesis.

In [62]:
# Ejemplo: 
df[["Sex", "Age", "Survived"]].head()

      Sex   Age  Survived
0    male  22.0         0
1  female  38.0         1
2  female  26.0         1
3  female  35.0         1
4    male  35.0         0

In [63]:
# Ejemplo2: 
df[["Name", "Pclass"]].head()

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                           Allen, Mr. William Henry       3

Imprime las columnas seleccionadas: sexo,edad y si sobrevivi√≥ el head() hace que se impriman los 5 primeros. 

Lo mismo para las columnas Nombre y Clase.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n de df.loc[]

Sirve para acceder a filas y columnas por su etiqueta.

In [64]:
# Ejemplo: 
df.loc[0,"Name"]

'Braund, Mr. Owen Harris'

In [65]:
# Ejemplo2: 
df.loc[1,"Age"]

np.float64(38.0)

Estamos accediendo a la columna Nombre en la primera posici√≥n.

En el segundo ejemplo a la edad de la segunda persona.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n de df.iloc[]

Accedemos a una posici√≥n de forma num√©rica

In [66]:
#Ejemplo:
df.iloc[0,3]

'Braund, Mr. Owen Harris'

In [67]:
#Ejemplo2:
df.iloc[1,4]

'female'

En el primer ejemplo estamos accediendo al primer elemento de la columna 3 que equivale al nombre. 

En el segundo ejemplo accedemos al segundo elemento de la columna 4.

# -------------------------------------------------------------------------------------------------------


## üîé Step 3: Filtering Rows

Functions to explore:
- df[df["Age"] > 30]
- df.query("Sex == 'female' and Survived == 1")

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n de df[df[""] > parametro]

Sirve para que imprima datos con una condici√≥n.

In [68]:

# Ejemplo: 
df[df["Age"] > 50].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C

In [69]:
# Ejemplo2: 
df[df["Name"] == 'Braund, Mr. Owen Harris'].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

En el primer ejemplo seleccionamos los 5 primeros elementos que en la columna edad sean mayores a 50 a√±os.

En el segundo ejemplo seleccionamos al elemento  que en la columna nombre se llame Braund, Mr. Owen Harris

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df.query()

Sirve para que imprima datos con una condici√≥n.

In [70]:
# Ejemplo: 
df.query("Sex == 'female' and Survived == 1").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [71]:
# Ejemplo2: 
df.query("Age == 20 and Sex == 'male'").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
91,92,0,3,"Andreasson, Mr. Paul Edvin",male,20.0,0,0,347466,7.8542,NaN,S
131,132,0,3,"Coelho, Mr. Domingos Fernandeo",male,20.0,0,0,SOTON/O.Q. 3101307,7.0500,NaN,S
378,379,0,3,"Betros, Mr. Tannous",male,20.0,0,0,2648,4.0125,NaN,C
441,442,0,3,"Hampe, Mr. Leon",male,20.0,0,0,345769,9.5000,NaN,S

El primer Ejemplo imprime los 5 primeros elementos que sean mujeres que sobrevivieron.

El segundo ejemplo se imprime para todos los hombres de 20 a√±os.

# -------------------------------------------------------------------------------------------------------


## üßπ Step 4: Handling Missing Data

Functions to explore:
- df.isna()
- df.isna().sum()
- df.dropna()
- df.fillna()

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df.isna()

Devuelve true o false si en alguna de las filas de las columnas hay alg√∫n NaN

In [72]:
#Ejemplo1:
df.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [73]:
#Ejemplo2:
df[df["Cabin"].isna()].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

Devuelve una tabla con cada fila y columna diciendo true si ese dato es NaN.

En el ejemplo dos imprimimos los 5 primeros elementos que tengan NaN en la columna Cabina.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df.isna().sum()

Devuelve la cantidad de NaN por columna.

In [74]:
#Ejemplo1:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [75]:
#Ejemplo2:
df.isna().sum(axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

Devuelve una tabla con el n√∫mero  de NaN por cada columna.

Devuelve el n√∫mero  de NaN por cada fila.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df.dropna()

Elimina las filas que contengan datos NaN

In [76]:
#Ejemplo1:
df.dropna().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [77]:
#Ejemplo2:
df.dropna(axis=1).head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500

El primer ejemplo elimina filas con valores faltantes.

El segundo ejemplo elimina columnas con valores restantes.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df.fillna()

Rellena los valores faltantes NaN

In [78]:
#Exemplo1:
df.fillna('Vacio')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,Vacio,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,Vacio,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,Vacio,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,Vacio,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,Vacio,1,2,W./C. 6607,23.4500,Vacio,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Vacio,Q

In [79]:
#Exemplo2:
df['Age'].fillna('Vacio').head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: object

El primer ejemplo pone el valor Vaci√≥n en todos los datos que sean NaN.

El segundo ejemplo pone Vac√≠o en la columna Edad a todos los datos NaN.

# -------------------------------------------------------------------------------------------------------


## üìä Step 5: Grouping and Aggregating

Functions to explore:
- df.groupby("Sex")["Survived"].mean()
- df["Fare"].mean()
- df["Age"].median()

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df.groupby("")[""].mean()

df.groupby() agrupa por campos en este caso sexo en dos grupos hombres y mujeres y mean hace la media en este caso la media de gete que sobrevivi√≥ en cada sexo.

In [80]:

# Ejmeplo1: 
df.groupby("Sex")["Survived"].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [81]:
#Ejemplo2:
df.groupby("Age")["Survived"].mean()

Age
0.42     1.0
0.67     1.0
0.75     1.0
0.83     1.0
0.92     1.0
        ...
70.00    0.0
70.50    0.0
71.00    0.0
74.00    0.0
80.00    1.0
Name: Survived, Length: 88, dtype: float64

En el primer ejemplo agrupa por sexos y dice la media de supervivientes.

En el segundo ejemplo agrupa por edad y dice la media de supervivientes.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df["Fare"].mean()

Devuelve el promedio de una columna

In [82]:
#Ejemplo1:
df["Fare"].mean()

np.float64(32.204207968574636)

In [83]:
#Ejemplo2:
df["Age"].mean()

np.float64(29.69911764705882)

En el primer ejemplo da el promedio de las tarifas.

En el segundo ejemplo se da el promedio de las edades.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df["Age"].median()

Devuelve la media de una columna

In [84]:
#Ejemplo1
df["Age"].median()

np.float64(28.0)

In [85]:
#Ejemplo2:
df["Fare"].median()

np.float64(14.4542)

En el primer ejemplo se da la media de las edades.

En el segundo ejemplo da la media de las tarifas.

# -------------------------------------------------------------------------------------------------------


## üìà Step 6: Sorting and Counting

Functions to explore:
- df.sort_values("Age")
- df["Sex"].unique()
- df["Pclass"].value_counts()

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n de df.sort_values("Age")

Muestra los valores m√°s peque√±os de la columna que le pasemos.

In [86]:
#Ejemplo1:
df.sort_values("Age").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S

In [87]:
#Ejemplo2:
df.sort_values("Fare").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0,B102,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0,NaN,S
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S

En el primer ejemplo da los valores m√°s peque√±os de edades.

En el segundo ejemplo da los valores m√°s peque√±os de tarifas.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n de df["Sex"].unique()

Devuelve los valores que son √∫nicos de la columna que le pasemos.

In [88]:
#Ejemplo1:
df["Sex"].unique()

array(['male', 'female'], dtype=object)

In [89]:
#Ejemplo1:
df["Pclass"].unique()

array([3, 1, 2])

En el primer ejemplo devuelve los valores que son √∫nicos de la columna sexo.

En el segundo ejemplo devuelve los valores que son √∫nicos de la columna Clase.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n de df["Pclass"].value_counts()

Pone los distintos valores que hay en esa columna y la cantidad que hay.

In [90]:
#Ejemplo1:
df["Pclass"].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [91]:
#Ejemplo2:
df["Sex"].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

En el primer ejemplo devuelve las cantidades de personas que hay en los valores de clases.

En el segundo ejemplo devuelve las cantidades de personas que hay en los valores de sexo.

# -------------------------------------------------------------------------------------------------------


## ‚öôÔ∏è Step 7: Creating or Modifying Columns

Functions to explore:
- df.assign()
- df.apply()
- df["new_col"] = ...
- pd.concat()
- pd.merge()

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n de df.assign()

Sirve para modificar o crear nuevas columnas pero haciendo una copia del dataFrame original.

In [92]:
#Ejemplo1:
nuevo= df.assign(Edad2=df["Age"]+5)
nuevo.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Edad2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,27.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,43.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,31.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,40.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,40.0

In [93]:
#Ejemplo2:
nuevo2= df.assign(Saludo="Hola")
nuevo2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Saludo
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Hola
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Hola
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Hola
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Hola
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Hola

En el primer ejemplo se crea una nueva columna a√±adiendo 3 a√±os m√°s a los datos de la columna edad.

En el segundo ejemplo se crea una nueva columna saludo con el valor hola.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n de df.apply()

Sirve para aplicar una funci√≥n a lo largo de las filas o columnas.

In [94]:
#Ejemplo1:
def miFuncion(columna):
    return columna+1


df["Age"].apply(miFuncion)

0      23.0
1      39.0
2      27.0
3      36.0
4      36.0
       ...
886    28.0
887    20.0
888     NaN
889    27.0
890    33.0
Name: Age, Length: 891, dtype: float64

In [95]:
#Ejemplo2:
def miFuncion(columna):
    return columna + " Hi"


df["Name"].apply(miFuncion).head()

0                           Braund, Mr. Owen Harris Hi
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                            Heikkinen, Miss. Laina Hi
3      Futrelle, Mrs. Jacques Heath (Lily May Peel) Hi
4                          Allen, Mr. William Henry Hi
Name: Name, dtype: object

En el primer ejemplo se crea una funci√≥n que va por cada fila y suma uno al seleccionar la columna edad suma 1 a√±o.

En el segundo ejemplo se crea una funci√≥n que va por cada fila y a√±ade Hi a los nombres de las personas.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df["new_col"] = ...

Sirve para modificar o crear nuevas columnas modificando el dataFrame original.

In [96]:
#Ejemplo1:
df["SoyNuevo"]="Hi i am new"

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SoyNuevo
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Hi i am new
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Hi i am new
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Hi i am new
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Hi i am new
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Hi i am new

In [97]:
#Ejemplo2:

df["SoyNuevo"]= ""
for x in range(len(df)):
    df.loc[x,"SoyNuevo"]=x


df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SoyNuevo
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,4

En el primer ejemplo se crea una una columna que tendr√° el valor hi i am new para todas las filas.

En el segundo ejemplo se crea una columna y mediante un bucle se le va poniendo un valor a cada fila.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n pd.concat()

Concatena dataframes

In [98]:
#Ejemplo1:
df1 = pd.DataFrame({"Nombre": ["Iv√°n"], "Apellido": ["Leal"]})

concatenado= pd.concat([df,df1], axis=1)
concatenado

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SoyNuevo,Nombre,Apellido
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,Iv√°n,Leal
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,NaN,NaN
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3,NaN,NaN
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,4,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,886,NaN,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,887,NaN,NaN
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,888,NaN,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,889,NaN,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,890,NaN,NaN

In [99]:
#Ejemplo2:
df1 = pd.DataFrame({"A": [1, 2], "B": [3, 4]})
df2 = pd.DataFrame({"B": [5, 6], "C": [7, 8]})

pd.concat([df1, df2],axis=0)

     A  B    C
0  1.0  3  NaN
1  2.0  4  NaN
0  NaN  5  7.0
1  NaN  6  8.0

En el primer ejemplo se concatenan los dataframes por columna.

En el segundo ejemplo se concatenan los dataframes por fila.

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n de pd.merge()

Combina filas de dos DataFrames comparando los valores de una o m√°s columnas.

In [100]:
#Ejemplo1:

df1 = pd.DataFrame({"PassengerId":[1], "Nombre": ["Iv√°n"], "Apellido": ["Leal"]})

nuevoMerge= pd.merge(df, df1, on="PassengerId", how="inner")


nuevoMerge

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SoyNuevo,Nombre,Apellido
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,0,Iv√°n,Leal

In [101]:
#Ejemplo2:

df2 = pd.DataFrame({"PassengerId":[1], "Comida": ["Queso"], "Estado": ["Podrido"]})

nuevoMerge2= pd.merge(df, df2, on="PassengerId", how="inner")


nuevoMerge2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SoyNuevo,Comida,Estado
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,0,Queso,Podrido

En el primer ejemplo se crea un dataferame con una columna igual en cada uno de estos y uno de las finas con el mismo valor en esa columna.

En el segundo ejemplo se crea un dataferame con una columna igual en cada uno de estos y uno de las finas con el mismo valor en esa columna.

# -------------------------------------------------------------------------------------------------------


## üíæ Step 8: Exporting Data

Function to explore:
- df.to_csv("output.csv", index=False)

# -------------------------------------------------------------------------------------------------------

# Explicaci√≥n df.to_csv()

Sirve para guardar un DataFrame en un archivo CSV

In [102]:
#Ejemplo1
df.to_csv("titanic_cleaned.csv", index=False)

In [103]:
#Ejemplo2
df.to_csv("titanic_NuevoIvan.csv", index=False)

En el primer ejemplo guardamos el dataframe df en un archivo csv llamado titanic_cleaned.csv.

En el segundo ejemplo guardamos el dataframe df en un archivo csv llamado titanic_NuevoIvan.csv.

# -------------------------------------------------------------------------------------------------------


## üß© Step 9: Summary

Reflect on what you learned:
#### Which functions were most useful?
Principalmente las funciones que me parecieron m√°s relevantes fueron:
- Merge(): Gracias a la importancia de poder unir dos dataframes mediante una columna com√∫n.
- df.assign(): Permite hacer una copia del dataframe y a√±adir y modificar datos si se toca el dataframe original.
- df["nuevaColumna"]: Permite a√±adir columnas al dataframe de manera muy simple.
- df.groupby: Muy importante agrupar para poder visualizar datos por ejemplo la cantidad total de hombres o mujeres.


#### What insights did you gain from the Titanic dataset?
- La edad de los hombres muertos es muy baja, es decir eran j√≥venes.
- En cantidad de supervivientes hay gran diferencia ya que muchas mujeres sobrevivieron a comparaci√≥n con los hombres.
- Solo hay supervivientes de los pasajeros de clase C.